app/controllers/shares_controller.rb

  def index
    @shares = Share.all # Получение списка всех домов
---
SELECT "shares".* FROM "shares"

  def show
    @share = Share.find(params[:id])
---
SELECT "shares".* FROM "shares" WHERE "shares"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @share = Share.new(share_param) # Создание новой статьи дома с переданными параметрами


    if @share.save
---
INSERT INTO "shares" ("name", "email", "phone", "created_at", "updated_at", "cost", "owner") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "рнкб"], ["email", nil], ["phone", nil], ["created_at", "2023-12-20 09:31:05.253573"], ["updated_at", "2023-12-20 09:31:05.253573"], ["cost", "1.0"], ["owner", nil]]

  def edit
    @share = Share.find(params[:id])
---
SELECT "shares".* FROM "shares" WHERE "shares"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def update
    @share = Share.find(params[:id])
    if @share.update(share_params)
---
SELECT "shares".* FROM "shares" WHERE "shares"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "shares" SET "updated_at" = $1, "cost" = $2 WHERE "shares"."id" = $3  [["updated_at", "2023-12-25 10:10:07.961745"], ["cost", "666666.0"], ["id", 39]]

  def buy
    @share = Share.find(params[:id])
    @share.owner = current_user.first_name
    @share.save
---
SELECT "shares".* FROM "shares" WHERE "shares"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]
SELECT "shares".* FROM "shares" WHERE "shares"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "shares" SET "updated_at" = $1, "owner" = $2 WHERE "shares"."id" = $3  [["updated_at", "2023-12-20 04:59:51.127628"], ["owner", "bobr"], ["id", 17]]

  def sell
    @share = Share.find(params[:id])
    @share.owner = nil
    @share.save
---
SELECT "shares".* FROM "shares" WHERE "shares"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
UPDATE "shares" SET "updated_at" = $1, "owner" = $2 WHERE "shares"."id" = $3  [["updated_at", "2023-12-20 05:02:02.192046"], ["owner", nil], ["id", 16]]

  def destroy
    @share = Share.find(params[:id])
    @share.destroy
---
SELECT "shares".* FROM "shares" WHERE "shares"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
DELETE FROM "shares" WHERE "shares"."id" = $1  [["id", 21]]